tiborsimon/embedded-tdd-headers/pic/pic18/pic18f448_tdd.h
#define RXB1EIDL_EID7                 1091
#define RXB1EID7                      1092
#define RXB1DLC                       1093
#define RXB1DLC0                      1094
#define RXB1DLC_DLC0                  1095
#define RXB1DLC1                      1096
#define RXB1DLC_DLC1                  1097
#define RXB1DLC2                      1098
#define RXB1DLC_DLC2                  1099
#define RXB1DLC3                      1100
#define RXB1DLC_DLC3                  1101
#define RXB1DLC_RESB0                 1102
#define RXB1RB0                       1103
#define RXB1DLC_RB0                   1104
#define RXB1DLC_RESB1                 1105
#define RXB1RB1                       1106
#define RXB1DLC_RB1                   1107
#define RXB1DLC_RXRTR                 1108
#define RXB1RTR                       1109
#define RXB1D0                        1110
#define RXB1D00                       1111
#define RXB1D01                       1112
#define RXB1D02                       1113
#define RXB1D03                       1114
#define RXB1D04                       1115
#define RXB1D05                       1116
#define RXB1D06                       1117
#define RXB1D07                       1118
#define RXB1D1                        1119
#define RXB1D10                       1120
#define RXB1D11                       1121
#define RXB1D12                       1122
#define RXB1D13                       1123
#define RXB1D14                       1124
#define RXB1D15                       1125
#define RXB1D16                       1126
#define RXB1D17                       1127
#define RXB1D2                        1128
#define RXB1D20                       1129
#define RXB1D21                       1130
#define RXB1D22                       1131
#define RXB1D23                       1132
#define RXB1D24                       1133
#define RXB1D25                       1134
#define RXB1D26                       1135
#define RXB1D27                       1136
#define RXB1D3                        1137
#define RXB1D30                       1138
#define RXB1D31                       1139
#define RXB1D32                       1140
#define RXB1D33                       1141
#define RXB1D34                       1142
#define RXB1D35                       1143
#define RXB1D36                       1144
#define RXB1D37                       1145
#define RXB1D4                        1146
#define RXB1D40                       1147
#define RXB1D41                       1148
#define RXB1D42                       1149
#define RXB1D43                       1150
#define RXB1D44                       1151
#define RXB1D45                       1152
#define RXB1D46                       1153
#define RXB1D47                       1154
#define RXB1D5                        1155
#define RXB1D50                       1156
#define RXB1D51                       1157
#define RXB1D52                       1158
#define RXB1D53                       1159
#define RXB1D54                       1160
#define RXB1D55                       1161
#define RXB1D56                       1162
#define RXB1D57                       1163
#define RXB1D6                        1164
#define RXB1D60                       1165
#define RXB1D61                       1166
#define RXB1D62                       1167
#define RXB1D63                       1168
#define RXB1D64                       1169
#define RXB1D65                       1170
#define RXB1D66                       1171
#define RXB1D67                       1172
#define RXB1D7                        1173
#define RXB1D70                       1174
#define RXB1D71                       1175
#define RXB1D72                       1176
#define RXB1D73                       1177
#define RXB1D74                       1178
#define RXB1D75                       1179
#define RXB1D76                       1180
#define RXB1D77                       1181
#define CANSTATRO1                    1182
#define CANSTATRO1_ICODE0             1183
#define CANSTATRO1_ICODE1             1184
#define CANSTATRO1_ICODE2             1185
#define CANSTATRO1_OPMODE0            1186
#define CANSTATRO1_OPMODE1            1187
#define CANSTATRO1_OPMODE2            1188
#define RXB0CON                       1189
#define RXB0FILHIT0                   1190
#define RXB0CON_FILHIT0               1191
#define RXB0FILHIT1                   1192
#define JTOFF                         1193
#define RXB0FILHIT2                   1194
#define RXB0DBEN                      1195
#define RXB0CON_RXRTRRO               1196
#define RXB0FILHIT3                   1197
#define RXB0RTRR0                     1198
#define RXB0RTRRO                     1199
#define RXB0M0                        1200
#define RXB0CON_RXM0                  1201
#define RXB0M1                        1202
#define RXB0CON_RXM1                  1203
#define RXB0CON_RXFUL                 1204
#define RXB0FUL                       1205
#define RXB0SIDH                      1206
#define RXB0SIDH_SID3                 1207
#define RXB0SID3                      1208
#define RXB0SIDH_SID4                 1209
#define RXB0SID4                      1210
#define RXB0SIDH_SID5                 1211
#define RXB0SID5                      1212
#define RXB0SIDH_SID6                 1213
#define RXB0SID6                      1214
#define RXB0SIDH_SID7                 1215
#define RXB0SID7                      1216
#define RXB0SIDH_SID8                 1217
#define RXB0SID8                      1218
#define RXB0SIDH_SID9                 1219
#define RXB0SID9                      1220
#define RXB0SIDH_SID10                1221
#define RXB0SID10                     1222
#define RXB0SIDL                      1223
#define RXB0SIDL_EID16                1224
#define RXB0EID16                     1225
#define RXB0SIDL_EID17                1226
#define RXB0EID17                     1227
#define RXB0EXID                      1228
#define RXB0SIDL_EXID                 1229
#define RXB0SRR                       1230
#define RXB0SIDL_SRR                  1231
#define RXB0SID0                      1232
#define RXB0SIDL_SID0                 1233
#define RXB0SID1                      1234
#define RXB0SIDL_SID1                 1235
#define RXB0SIDL_SID2                 1236
#define RXB0SID2                      1237
#define RXB0EIDH                      1238
#define RXB0EID8                      1239
#define RXB0EIDH_EID8                 1240
#define RXB0EID9                      1241
#define RXB0EIDH_EID9                 1242
#define RXB0EID10                     1243
#define RXB0EIDH_EID10                1244
#define RXB0EID11                     1245
#define RXB0EIDH_EID11                1246
#define RXB0EID12                     1247
#define RXB0EIDH_EID12                1248
#define RXB0EID13                     1249
#define RXB0EIDH_EID13                1250
#define RXB0EID14                     1251
#define RXB0EIDH_EID14                1252
#define RXB0EID15                     1253
#define RXB0EIDH_EID15                1254
#define RXB0EIDL                      1255
#define RXB0EID0                      1256
#define RXB0EIDL_EID0                 1257
#define RXB0EID1                      1258
#define RXB0EIDL_EID1                 1259
#define RXB0EID2                      1260
#define RXB0EIDL_EID2                 1261
#define RXB0EID3                      1262
#define RXB0EIDL_EID3                 1263
#define RXB0EID4                      1264
#define RXB0EIDL_EID4                 1265
#define RXB0EID5                      1266
#define RXB0EIDL_EID5                 1267
#define RXB0EID6                      1268
#define RXB0EIDL_EID6                 1269
#define RXB0EID7                      1270
#define RXB0EIDL_EID7                 1271
#define RXB0DLC                       1272
#define RXB0DLC_DLC0                  1273
#define RXB0DLC0                      1274
#define RXB0DLC1                      1275
#define RXB0DLC_DLC1                  1276
#define RXB0DLC2                      1277
#define RXB0DLC_DLC2                  1278
#define RXB0DLC3                      1279
#define RXB0DLC_DLC3                  1280
#define RXB0RB0                       1281
#define RXB0DLC_RESB0                 1282
#define RXB0DLC_RB0                   1283
#define RXB0DLC_RESB1                 1284
#define RXB0RB1                       1285
#define RXB0DLC_RB1                   1286
#define RXB0DLC_RXRTR                 1287
#define RXB0RTR                       1288
#define RXB0D0                        1289
#define RB0D00                        1290
#define RXB0D00                       1291
#define RB0D01                        1292
#define RXB0D01                       1293
#define RB0D02                        1294
#define RXB0D02                       1295
#define RB0D03                        1296
#define RXB0D03                       1297
#define RB0D04                        1298
#define RXB0D04                       1299
#define RB0D05                        1300
#define RXB0D05                       1301
#define RB0D06                        1302
#define RXB0D06                       1303
#define RB0D07                        1304
#define RXB0D07                       1305
#define RXB0D1                        1306
#define RB0D10                        1307
#define RXB0D10                       1308
#define RB0D11                        1309
#define RXB0D11                       1310
#define RB0D12                        1311
#define RXB0D12                       1312
#define RB0D13                        1313
#define RXB0D13                       1314
#define RB0D14                        1315
#define RXB0D14                       1316
#define RB0D15                        1317
#define RXB0D15                       1318
#define RB0D16                        1319
#define RXB0D16                       1320
#define RB0D17                        1321
#define RXB0D17                       1322
#define RXB0D2                        1323
#define RXB0D20                       1324
#define RB0D20                        1325
#define RXB0D21                       1326
#define RB0D21                        1327
#define RXB0D22                       1328
#define RB0D22                        1329
#define RXB0D23                       1330
#define RB0D23                        1331
#define RXB0D24                       1332
#define RB0D24                        1333
#define RXB0D25                       1334
#define RB0D25                        1335
#define RXB0D26                       1336
#define RB0D26                        1337
#define RXB0D27                       1338
#define RB0D27                        1339
#define RXB0D3                        1340
#define RXB0D30                       1341
#define RB0D30                        1342
#define RXB0D31                       1343
#define RB0D31                        1344
#define RXB0D32                       1345
#define RB0D32                        1346
#define RXB0D33                       1347
#define RB0D33                        1348
#define RXB0D34                       1349
#define RB0D34                        1350
#define RXB0D35                       1351
#define RB0D35                        1352
#define RXB0D36                       1353
#define RB0D36                        1354
#define RXB0D37                       1355
#define RB0D37                        1356
#define RXB0D4                        1357
#define RB0D40                        1358
#define RXB0D40                       1359
#define RB0D41                        1360
#define RXB0D41                       1361
#define RB0D42                        1362
#define RXB0D42                       1363
#define RB0D43                        1364
#define RXB0D43                       1365
#define RB0D44                        1366
#define RXB0D44                       1367
#define RB0D45                        1368
#define RXB0D45                       1369
#define RB0D46                        1370
#define RXB0D46                       1371
#define RB0D47                        1372
#define RXB0D47                       1373
#define RXB0D5                        1374
#define RB0D50                        1375
#define RXB0D50                       1376
#define RB0D51                        1377
#define RXB0D51                       1378
#define RB0D52                        1379
#define RXB0D52                       1380
#define RB0D53                        1381
#define RXB0D53                       1382
#define RB0D54                        1383
#define RXB0D54                       1384
#define RB0D55                        1385
#define RXB0D55                       1386
#define RB0D56                        1387
#define RXB0D56                       1388
#define RB0D57                        1389
#define RXB0D57                       1390
#define RXB0D6                        1391
#define RXB0D60                       1392
#define RB0D60                        1393
#define RXB0D61                       1394
#define RB0D61                        1395
#define RB0D62                        1396
#define RXB0D62                       1397
#define RB0D63                        1398
#define RXB0D63                       1399
#define RB0D64                        1400
#define RXB0D64                       1401
#define RB0D65                        1402
#define RXB0D65                       1403
#define RB0D66                        1404
#define RXB0D66                       1405
#define RXB0D67                       1406
#define RB0D67                        1407
#define RXB0D7                        1408
#define RB0D70                        1409
#define RXB0D70                       1410
#define RB0D71                        1411
#define RXB0D71                       1412
#define RB0D72                        1413
#define RXB0D72                       1414
#define RB0D73                        1415
#define RXB0D73                       1416
#define RB0D74                        1417
#define RXB0D74                       1418
#define RB0D75                        1419
#define RXB0D75                       1420
#define RB0D76                        1421
#define RXB0D76                       1422
#define RB0D77                        1423
#define RXB0D77                       1424
#define CANSTAT                       1425
#define EICODE1                       1426
#define CANSTAT_ICODE0                1427
#define EICODE2                       1428
#define CANSTAT_ICODE1                1429
#define EICODE3                       1430
#define CANSTAT_ICODE2                1431
#define CANSTAT_OPMODE0               1432
#define CANSTAT_OPMODE1               1433
#define CANSTAT_OPMODE2               1434
#define CANCON                        1435
#define WIN0                          1436
#define FP1                           1437
#define WIN1                          1438
#define FP2                           1439
#define FP3                           1440
#define WIN2                          1441
#define ABAT                          1442
#define REQOP0                        1443
#define REQOP1                        1444
#define REQOP2                        1445
#define BRGCON1                       1446
#define BRP0                          1447
#define BRP1                          1448
#define BRP2                          1449
#define BRP3                          1450
#define BRP4                          1451
#define BRP5                          1452
#define SJW0                          1453
#define SJW1                          1454
#define BRGCON2                       1455
#define PRSEG0                        1456
#define PRSEG1                        1457
#define PRSEG2                        1458
#define SEG1PH0                       1459
#define SEG1PH1                       1460
#define SEG1PH2                       1461
#define SAM                           1462
#define SEG2PHT                       1463
#define SEG2PHTS                      1464
#define BRGCON3                       1465
#define SEG2PH0                       1466
#define SEG2PH1                       1467
#define SEG2PH2                       1468
#define WAKFIL                        1469
#define CIOCON                        1470
#define CANCAP                        1471
#define ENDRHI                        1472
#define COMSTAT                       1473
#define EWARN                         1474
#define RXWARN                        1475
#define TXWARN                        1476
#define RXBP                          1477
#define TXBP                          1478
#define TXBO                          1479
#define RX2OVFL                       1480
#define RXB1OVFL                      1481
#define RXBNOVFL                      1482
#define RX1OVFL                       1483
#define FIFOEMPTY                     1484
#define RXB0OVFL                      1485
#define RXERRCNT                      1486
#define REC0                          1487
#define REC1                          1488
#define REC2                          1489
#define REC3                          1490
#define REC4                          1491
#define REC5                          1492
#define REC6                          1493
#define REC7                          1494
#define TXERRCNT                      1495
#define TEC0                          1496
#define TEC1                          1497
#define TEC2                          1498
#define TEC3                          1499
#define TEC4                          1500
#define TEC5                          1501
#define TEC6                          1502
#define TEC7                          1503
#define PORTA                         1504
#define AN0                           1505
#define ULPWUIN                       1506
#define PORTA_RA0                     1507
#define CVREF                         1508
#define AN1                           1509
#define PORTA_RA1                     1510
#define AN2                           1511
#define PORTA_RA2                     1512
#define VREFM                         1513
#define AN3                           1514
#define PORTA_RA3                     1515
#define VREFP                         1516
#define PORTA_RA4                     1517
#define T0CKI                         1518
#define AN4                           1519
#define PORTA_RA5                     1520
#define NOT_SS                        1521
#define LVDIN                         1522
#define nSS                           1523
#define SS                            1524
#define CLKO                          1525
#define PORTA_RA6                     1526
#define OSC2                          1527
#define PORTB                         1528
#define INT0                          1529
#define PORTB_RB0                     1530
#define INT1                          1531
#define PORTB_RB1                     1532
#define CANTX                         1533
#define PORTB_RB2                     1534
#define CCP2_PA2                      1535
#define CANRX                         1536
#define PORTB_RB3                     1537
#define PORTB_RB4                     1538
#define PGM                           1539
#define PORTB_RB5                     1540
#define PGC                           1541
#define PORTB_RB6                     1542
#define PGD                           1543
#define PORTB_RB7                     1544
#define PORTC                         1545
#define T1CKI                         1546
#define T1OSO                         1547
#define PORTC_RC0                     1548
#define CCP2                          1549
#define T1OSI                         1550
#define PA2                           1551
#define PORTC_RC1                     1552
#define CCP1                          1553
#define PA1                           1554
#define PORTC_RC2                     1555
#define SCL                           1556
#define SCK                           1557
#define PORTC_RC3                     1558
#define SDA                           1559
#define SDI                           1560
#define PORTC_RC4                     1561
#define SDO                           1562
#define PORTC_RC5                     1563
#define TX                            1564
#define CK                            1565
#define PORTC_RC6                     1566
#define DT                            1567
#define RX                            1568
#define PORTC_RC7                     1569
#define PORTD                         1570
#define C1INP                         1571
#define PSP0                          1572
#define PORTD_RD0                     1573
#define C1INM                         1574
#define PSP1                          1575
#define PORTD_RD1                     1576
#define PSP2                          1577
#define PORTD_RD2                     1578
#define C2INP                         1579
#define PSP3                          1580
#define PORTD_RD3                     1581
#define C2INM                         1582
#define PSP4                          1583
#define P1A                           1584
#define ECCP1                         1585
#define PORTD_RD4                     1586
#define PSP5                          1587
#define P1B                           1588
#define PORTD_RD5                     1589
#define PSP6                          1590
#define P1C                           1591
#define PORTD_RD6                     1592
#define PSP7                          1593
#define P1D                           1594
#define SS2                           1595
#define PORTD_RD7                     1596
#define PORTE                         1597
#define NOT_RD                        1598
#define nRD                           1599
#define AN5                           1600
#define PORTE_RD                      1601
#define PD2                           1602
#define RDE                           1603
#define PORTE_RE0                     1604
#define AN6                           1605
#define NOT_WR                        1606
#define PORTE_WR                      1607
#define WRE                           1608
#define nWR                           1609
#define PORTE_RE1                     1610
#define PC2                           1611
#define nCS                           1612
#define NOT_CS                        1613
#define CCP10                         1614
#define PB2                           1615
#define CS                            1616
#define PORTE_RE2                     1617
#define AN7                           1618
#define LATA                          1619
#define LATA0                         1620
#define LA0                           1621
#define LATA1                         1622
#define LA1                           1623
#define LATA2                         1624
#define LA2                           1625
#define LATA3                         1626
#define LA3                           1627
#define LATA4                         1628
#define LA4                           1629
#define LATA5                         1630
#define LA5                           1631
#define LATA6                         1632
#define LA6                           1633
#define LATB                          1634
#define LB0                           1635
#define LATB0                         1636
#define LB1                           1637
#define LATB1                         1638
#define LB2                           1639
#define LATB2                         1640
#define LB3                           1641
#define LATB3                         1642
#define LB4                           1643
#define LATB4                         1644
#define LB5                           1645
#define LATB5                         1646
#define LB6                           1647
#define LATB6                         1648
