tiborsimon/embedded-tdd-headers/pic/pic18/pic18f448_tdd.h
#define LB7                           1649
#define LATB7                         1650
#define LATC                          1651
#define LATC0                         1652
#define LC0                           1653
#define LATC1                         1654
#define LC1                           1655
#define LATC2                         1656
#define LC2                           1657
#define LATC3                         1658
#define LC3                           1659
#define LATC4                         1660
#define LC4                           1661
#define LATC5                         1662
#define LC5                           1663
#define LATC6                         1664
#define LC6                           1665
#define LATC7                         1666
#define LC7                           1667
#define LATD                          1668
#define LATD0                         1669
#define LD0                           1670
#define LATD1                         1671
#define LD1                           1672
#define LATD2                         1673
#define LD2                           1674
#define LATD3                         1675
#define LD3                           1676
#define LATD4                         1677
#define LD4                           1678
#define LATD5                         1679
#define LD5                           1680
#define LATD6                         1681
#define LD6                           1682
#define LATD7                         1683
#define LD7                           1684
#define LATE                          1685
#define LATE0                         1686
#define LE0                           1687
#define LATE1                         1688
#define LE1                           1689
#define LATE2                         1690
#define LE2                           1691
#define TRISA                         1692
#define TRISA_RA0                     1693
#define TRISA0                        1694
#define TRISA_RA1                     1695
#define TRISA1                        1696
#define TRISA2                        1697
#define TRISA_RA2                     1698
#define TRISA_RA3                     1699
#define TRISA3                        1700
#define TRISA_RA4                     1701
#define TRISA4                        1702
#define TRISA_RA5                     1703
#define TRISA5                        1704
#define TRISA_RA6                     1705
#define TRISA6                        1706
#define TRISB                         1707
#define TRISB_RB0                     1708
#define TRISB0                        1709
#define TRISB_RB1                     1710
#define TRISB1                        1711
#define TRISB_RB2                     1712
#define TRISB2                        1713
#define TRISB_RB3                     1714
#define TRISB3                        1715
#define TRISB_RB4                     1716
#define TRISB4                        1717
#define TRISB_RB5                     1718
#define TRISB5                        1719
#define TRISB_RB6                     1720
#define TRISB6                        1721
#define TRISB_RB7                     1722
#define TRISB7                        1723
#define TRISC                         1724
#define TRISC0                        1725
#define TRISC_RC0                     1726
#define TRISC1                        1727
#define TRISC_RC1                     1728
#define TRISC2                        1729
#define TRISC_RC2                     1730
#define TRISC3                        1731
#define TRISC_RC3                     1732
#define TRISC4                        1733
#define TRISC_RC4                     1734
#define TRISC5                        1735
#define TRISC_RC5                     1736
#define TRISC6                        1737
#define TRISC_RC6                     1738
#define TRISC7                        1739
#define TRISC_RC7                     1740
#define TRISD                         1741
#define TRISD_RD0                     1742
#define TRISD0                        1743
#define TRISD_RD1                     1744
#define TRISD1                        1745
#define TRISD_RD2                     1746
#define TRISD2                        1747
#define TRISD_RD3                     1748
#define TRISD3                        1749
#define TRISD_RD4                     1750
#define TRISD4                        1751
#define TRISD_RD5                     1752
#define TRISD5                        1753
#define TRISD_RD6                     1754
#define TRISD6                        1755
#define TRISD_RD7                     1756
#define TRISD7                        1757
#define TRISE                         1758
#define DDRE0                         1759
#define TRISE_RE0                     1760
#define TRISE0                        1761
#define DDRE1                         1762
#define TRISE_RE1                     1763
#define TRISE1                        1764
#define DDRE2                         1765
#define TRISE_RE2                     1766
#define TRISE2                        1767
#define PSPMODE                       1768
#define IBOV                          1769
#define OBF                           1770
#define IBF                           1771
#define PIE1                          1772
#define TMR1IE                        1773
#define TMR2IE                        1774
#define CCP1IE                        1775
#define SSPIE                         1776
#define PIE1_TX1IE                    1777
#define TXIE                          1778
#define RCIE                          1779
#define RC1IE                         1780
#define ADIE                          1781
#define PSPIE                         1782
#define PIR1                          1783
#define TMR1IF                        1784
#define TMR2IF                        1785
#define CCP1IF                        1786
#define SSPIF                         1787
#define TXIF                          1788
#define PIR1_TX1IF                    1789
#define RCIF                          1790
#define RC1IF                         1791
#define ADIF                          1792
#define PSPIF                         1793
#define IPR1                          1794
#define TMR1IP                        1795
#define TMR2IP                        1796
#define CCP1IP                        1797
#define SSPIP                         1798
#define TX1IP                         1799
#define TXIP                          1800
#define RC1IP                         1801
#define RCIP                          1802
#define ADIP                          1803
#define PSPIP                         1804
#define PIE2                          1805
#define ECCP1IE                       1806
#define TMR3IE                        1807
#define LVDIE                         1808
#define BCLIE                         1809
#define EEIE                          1810
#define CMIE                          1811
#define PIR2                          1812
#define ECCP1IF                       1813
#define TMR3IF                        1814
#define LVDIF                         1815
#define BCLIF                         1816
#define EEIF                          1817
#define CMIF                          1818
#define IPR2                          1819
#define ECCP1IP                       1820
#define TMR3IP                        1821
#define LVDIP                         1822
#define BCLIP                         1823
#define EEIP                          1824
#define CMIP                          1825
#define PIE3                          1826
#define RXB0IE                        1827
#define RX0IE                         1828
#define RXBNIE                        1829
#define RX1IE                         1830
#define RXB1IE                        1831
#define TXB0IE                        1832
#define TX0IE                         1833
#define PIE3_TX1IE                    1834
#define TXB1IE                        1835
#define TXB2IE                        1836
#define TXBNIE                        1837
#define TX2IE                         1838
#define ERRIE                         1839
#define WAKIE                         1840
#define IRXIE                         1841
#define IVRE                          1842
#define PIR3                          1843
#define RX0IF                         1844
#define RXB0IF                        1845
#define RXBNIF                        1846
#define RX1IF                         1847
#define RXB1IF                        1848
#define TX0IF                         1849
#define TXB0IF                        1850
#define PIR3_TX1IF                    1851
#define TXB1IF                        1852
#define TXB2IF                        1853
#define TXBNIF                        1854
#define TX2IF                         1855
#define ERRIF                         1856
#define WAKIF                         1857
#define IRXIF                         1858
#define IVRF                          1859
#define IPR3                          1860
#define RXB0IP                        1861
#define RXB1IP                        1862
#define RXBNIP                        1863
#define TXB0IP                        1864
#define TXB1IP                        1865
#define TXB2IP                        1866
#define TXBNIP                        1867
#define ERRIP                         1868
#define WAKIP                         1869
#define IVRP                          1870
#define IRXIP                         1871
#define EECON1                        1872
#define EECON1_RD                     1873
#define EECON1_WR                     1874
#define WREN                          1875
#define WRERR                         1876
#define FREE                          1877
#define CFGS                          1878
#define EEFS                          1879
#define EEPGD                         1880
#define RCSTA                         1881
#define RCD8                          1882
#define RX9D                          1883
#define OERR                          1884
#define FERR                          1885
#define ADDEN                         1886
#define CREN                          1887
#define SREN                          1888
#define SRENA                         1889
#define RC8_9                         1890
#define RC9                           1891
#define RX9                           1892
#define nRC8                          1893
#define NOT_RC8                       1894
#define SPEN                          1895
#define TXSTA                         1896
#define TXD8                          1897
#define TX9D1                         1898
#define TX9D                          1899
#define TRMT                          1900
#define TRMT1                         1901
#define BRGH1                         1902
#define BRGH                          1903
#define SYNC                          1904
#define SYNC1                         1905
#define TXEN1                         1906
#define TXEN                          1907
#define TX91                          1908
#define TX8_9                         1909
#define TX9                           1910
#define NOT_TX8                       1911
#define nTX8                          1912
#define CSRC1                         1913
#define CSRC                          1914
#define T3CON                         1915
#define TMR3ON                        1916
#define TMR3CS                        1917
#define nT3SYNC                       1918
#define NOT_T3SYNC                    1919
#define T3SYNC                        1920
#define T3INSYNC                      1921
#define SOSCEN3                       1922
#define T3CCP1                        1923
#define T3CKPS                        1924
#define T3CKPS0                       1925
#define T3CKPS1                       1926
#define T3ECCP1                       1927
#define T3CON_RD16                    1928
#define RD163                         1929
#define T3RD16                        1930
#define CMCON                         1931
#define CM                            1932
#define CMEN0                         1933
#define CM0                           1934
#define CMEN1                         1935
#define CM1                           1936
#define CMEN2                         1937
#define CM2                           1938
#define CIS                           1939
#define C1INV                         1940
#define C2INV                         1941
#define C1OUT                         1942
#define C2OUT                         1943
#define CVRCON                        1944
#define CVR                           1945
#define CVR0                          1946
#define CVR1                          1947
#define CVR2                          1948
#define CVR3                          1949
#define CVRSS                         1950
#define CVRR                          1951
#define CVROEN                        1952
#define CVROE                         1953
#define CVREN                         1954
#define PSSBD                         1955
#define PSSBD0                        1956
#define PSSBD1                        1957
#define PSSAC                         1958
#define PSSAC0                        1959
#define PSSAC1                        1960
#define ECCPAS0                       1961
#define ECCPAS                        1962
#define ECCPAS1                       1963
#define ECCPAS2                       1964
#define ECCPASE                       1965
#define ECCP1DEL                      1966
#define EPDC                          1967
#define EPDC0                         1968
#define EPDC1                         1969
#define EPDC2                         1970
#define EPDC3                         1971
#define EPDC4                         1972
#define EPDC5                         1973
#define EPDC6                         1974
#define EPDC7                         1975
#define ECCP1CON                      1976
#define ECCP1M                        1977
#define ECCP1M0                       1978
#define ECCP1M1                       1979
#define ECCP1M2                       1980
#define ECCP1M3                       1981
#define EDC1B                         1982
#define EDC1B0                        1983
#define EDC2B0                        1984
#define EDC1B1                        1985
#define EDC2B1                        1986
#define EPWM1M0                       1987
#define EPWM1M                        1988
#define EPWM1M1                       1989
#define CCP1CON                       1990
#define CCP1M0                        1991
#define CCP1M                         1992
#define CCP1M1                        1993
#define CCP1M2                        1994
#define CCP1M3                        1995
#define CCP1Y                         1996
#define DC1B                          1997
#define DC1B0                         1998
#define CCP1X                         1999
#define DC1B1                         2000
#define ADCON1                        2001
#define PCFG0                         2002
#define PCFG                          2003
#define PCFG1                         2004
#define PCFG2                         2005
#define CHSN3                         2006
#define PCFG3                         2007
#define ADCS2                         2008
#define ADFM                          2009
#define ADCON0                        2010
#define ADON                          2011
#define nDONE                         2012
#define GO_nDONE                      2013
#define NOT_DONE                      2014
#define GODONE                        2015
#define GO_DONE                       2016
#define DONE                          2017
#define GO                            2018
#define GO_NOT_DONE                   2019
#define CHS                           2020
#define CHS0                          2021
#define CHS1                          2022
#define CHS2                          2023
#define ADCS                          2024
#define ADCS0                         2025
#define ADCAL                         2026
#define ADCS1                         2027
#define SSPCON2                       2028
#define SEN                           2029
#define RSEN                          2030
#define PEN                           2031
#define RCEN                          2032
#define ACKEN                         2033
#define ACKDT                         2034
#define ACKSTAT                       2035
#define GCEN                          2036
#define SSPCON1                       2037
#define SSPM0                         2038
#define SSPM                          2039
#define SSPM1                         2040
#define SSPM2                         2041
#define SSPM3                         2042
#define CKP                           2043
#define SSPEN                         2044
#define SSPOV                         2045
#define WCOL                          2046
#define SSPSTAT                       2047
#define BF                            2048
#define UA                            2049
#define R_NOT_W                       2050
#define READ_WRITE                    2051
#define NOT_W                         2052
#define R_W                           2053
#define RW                            2054
#define R                             2055
#define NOT_WRITE                     2056
#define nW                            2057
#define nWRITE                        2058
#define R_nW                          2059
#define I2C_READ                      2060
#define START                         2061
#define S                             2062
#define I2C_START                     2063
#define STOP                          2064
#define I2C_STOP                      2065
#define P                             2066
#define NOT_A                         2067
#define I2C_DATA                      2068
#define nA                            2069
#define D_nA                          2070
#define D                             2071
#define DA                            2072
#define DATA_ADDRESS                  2073
#define D_A                           2074
#define D_NOT_A                       2075
#define NOT_ADDRESS                   2076
#define nADDRESS                      2077
#define I2C_DAT                       2078
#define CKE                           2079
#define SMP                           2080
#define T2CON                         2081
#define T2CKPS0                       2082
#define T2CKPS                        2083
#define T2CKPS1                       2084
#define TMR2ON                        2085
#define TOUTPS0                       2086
#define TOUTPS                        2087
#define TOUTPS1                       2088
#define TOUTPS2                       2089
#define TOUTPS3                       2090
#define PR2                           2091
#define WM0                           2092
#define WM1                           2093
#define WAIT0                         2094
#define WAIT1                         2095
#define EBDIS                         2096
#define T1CON                         2097
#define TMR1ON                        2098
#define TMR1CS                        2099
#define NOT_T1SYNC                    2100
#define T1SYNC                        2101
#define nT1SYNC                       2102
#define T1INSYNC                      2103
#define T1OSCEN                       2104
#define SOSCEN                        2105
#define T1CKPS0                       2106
#define T1CKPS                        2107
#define T1CKPS1                       2108
#define T1RD16                        2109
#define T1CON_RD16                    2110
#define RCON                          2111
#define BOR                           2112
#define NOT_BOR                       2113
#define nBOR                          2114
#define POR                           2115
#define nPOR                          2116
#define NOT_POR                       2117
#define nPD                           2118
#define NOT_PD                        2119
#define PD                            2120
#define NOT_TO                        2121
#define nTO                           2122
#define TO                            2123
#define nRI                           2124
#define NOT_RI                        2125
#define RI                            2126
#define nIPEN                         2127
#define IPEN                          2128
#define NOT_IPEN                      2129
#define WDTCON                        2130
#define SWDTE                         2131
#define SWDTEN                        2132
#define LVDCON                        2133
#define LVDL0                         2134
#define LVDL                          2135
#define LVDL1                         2136
#define LVDL2                         2137
#define LVDL3                         2138
#define LVDEN                         2139
#define IRVST                         2140
#define IVRST                         2141
#define OSCCON                        2142
#define SCS                           2143
#define T0CON                         2144
#define T0PS                          2145
#define T0PS0                         2146
#define T0PS1                         2147
#define T0PS2                         2148
#define PSA                           2149
#define T0SE                          2150
#define T0CS                          2151
#define T08BIT                        2152
#define TMR0ON                        2153
#define STATUS                        2154
#define C                             2155
#define CARRY                         2156
#define DC                            2157
#define ZERO                          2158
#define Z                             2159
#define OV                            2160
#define OVERFLOW                      2161
#define N                             2162
#define NEGATIVE                      2163
#define INTCON3                       2164
#define INT1IF                        2165
#define INT1F                         2166
#define INT2IF                        2167
#define INT2F                         2168
#define INT1E                         2169
#define INT1IE                        2170
#define INT2IE                        2171
#define INT2E                         2172
#define INT1P                         2173
#define INT1IP                        2174
#define INT2IP                        2175
#define INT2P                         2176
#define INTCON2                       2177
#define RBIP                          2178
#define TMR0IP                        2179
#define T0IP                          2180
#define INTEDG2                       2181
#define INTEDG1                       2182
#define INTEDG0                       2183
#define RBPU                          2184
#define NOT_RBPU                      2185
#define nRBPU                         2186
#define INTCON                        2187
#define RBIF                          2188
#define INT0F                         2189
#define INT0IF                        2190
#define T0IF                          2191
#define TMR0IF                        2192
#define RBIE                          2193
#define INT0E                         2194
#define INT0IE                        2195
#define T0IE                          2196
#define TMR0IE                        2197
#define PEIE                          2198
#define PEIE_GIEL                     2199
#define GIEL                          2200
#define GIE_GIEH                      2201
#define GIE                           2202
#define GIEH                          2203
#define STKPTR0                       2204
#define STKPTR                        2205
#define SP0                           2206
#define STKPTR1                       2207
#define SP1                           2208
#define STKPTR2                       2209
#define SP2                           2210
#define SP3                           2211
#define STKPTR3                       2212
#define STKPTR4                       2213
#define SP4                           2214
#define STKUNF                        2215
#define STKOVF                        2216
#define STKFUL                        2217

#endif // _PIC18F448_H_
